app/controllers/cities_controller.rb

  def create
    @city = City.new(city_params)

    if @city.save
---
INSERT INTO "cities" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Piraius"], ["created_at", "2017-10-30 16:21:28.278355"], ["updated_at", "2017-10-30 16:21:28.278355"]]